luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_regdef.h
/** \brief  Queue 0 Backup Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QBUR0_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_QBUR0;

/** \brief  Queue 0 Source Control Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QCTRL0_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_QCTRL0;

/** \brief  Queue 0 Input Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QINR0_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_QINR0;

/** \brief  Queue 0 Mode Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QMR0_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_G_QMR0;

/** \brief  Queue 0 Status Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QSR0_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_G_QSR0;

/** \brief  Group Result Control Reg. */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_RCR_Bits B;                  /**< \brief Bitfield access */
} Ifx_VADC_G_RCR;

/** \brief  Result Event Flag Clear Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_REFCLR_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_REFCLR;

/** \brief  Result Event Flag Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_REFLAG_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_REFLAG;

/** \brief  Group Result Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_RES_Bits B;                  /**< \brief Bitfield access */
} Ifx_VADC_G_RES;

/** \brief  Group Result Reg., Debug */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_RESD_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_G_RESD;

/** \brief  Result Event Node Pointer Register 0, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_REVNP0_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_REVNP0;

/** \brief  Result Event Node Pointer Register 1, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_REVNP1_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_REVNP1;

/** \brief  Result Assignment Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_RRASS_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_RRASS;

/** \brief  Source Event Flag Clear Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_SEFCLR_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_SEFCLR;

/** \brief  Source Event Flag Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_SEFLAG_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_SEFLAG;

/** \brief  Source Event Node Pointer Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_SEVNP_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_SEVNP;

/** \brief  Service Request Software Activation Trigger, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_SRACT_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_SRACT;

/** \brief  Synchronization Control Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_SYNCTR_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_SYNCTR;

/** \brief  Valid Flag Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_VFR_Bits B;                  /**< \brief Bitfield access */
} Ifx_VADC_G_VFR;

/** \brief  Global Boundary Select Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_GLOBBOUND_Bits B;              /**< \brief Bitfield access */
} Ifx_VADC_GLOBBOUND;

/** \brief  Global Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_GLOBCFG_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_GLOBCFG;

/** \brief  Global Event Flag Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_GLOBEFLAG_Bits B;              /**< \brief Bitfield access */
} Ifx_VADC_GLOBEFLAG;

